src/assets/artifacts/Spring-PetClinic/telemetry/behavior-models/efsm_diagram/efsm_model.dot
digraph EFSM {
  rankdir=LR;
  labelloc="t";
  label="GK-TAIL+ EFSM";
  node [shape=circle, fontname="Helvetica"];
  edge [fontname="Helvetica"];

  __start__ [shape=point];
  __start__ -> q0;

  q0;
  q1 [shape=doublecircle];
  q2;
  q3;
  q4;
  q5;
  q6;
  q7;
  q8;
  q9;
  q10;
  q11;
  q12;
  q13;
  q14;
  q15;
  q16;
  q17;
  q18;
  q19;
  q20;
  q21;
  q22;
  q23;
  q24;
  q25;
  q26;
  q27;
  q28;
  q29;
  q30;
  q31;
  q32;
  q33;
  q34;
  q35;
  q36;
  q37;
  q38;
  q39;
  q40;
  q41;
  q42;

  q0 -> q1 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@4e24b174\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@104ab57b\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@5bc0d62d\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@6b02f644\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@281a0671\"\n}]"];
  q0 -> q7 [label="OwnerController.setAllowedFields\n[dataBinder = \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@652b1eea\"]"];
  q0 -> q9 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@1279b142\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@7367b2bd\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@67b12a7\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@61b4da5c\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@3d79168b\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@6b0fc76b\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@6f06d068\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@7dd9a18c\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@628d3123\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@64eedae0\"\n}]"];
  q0 -> q37 [label="OwnerController.setAllowedFields\n[dataBinder = \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@5394dbfe\"]"];
  q0 -> q41 [label="OwnerController.setAllowedFields\n[dataBinder = \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@75ad0ea9\"]"];
  q0 -> q1 [label="OwnerRepository.findById"];
  q0 -> q1 [label="OwnerRepository.findByLastName"];
  q0 -> q1 [label="OwnerRepository.findPetTypes"];
  q0 -> q1 [label="OwnerRepository.save"];
  q0 -> q2 [label="PetController.findPet\n[ownerId = 1,\npetId in {\n    null,\n    1\n}]"];
  q0 -> q1 [label="VetController.showResourcesVetList"];
  q0 -> q27 [label="VetController.showVetList\n[page = 1]"];
  q0 -> q1 [label="VetRepository.findAll"];
  q0 -> q0 [label="VisitController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@41eb9743\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@1863ebc6\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@635b5740\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@7bd43ad7\"\n}]"];
  q0 -> q1 [label="VisitController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@3edea5f9\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@77129106\"\n}]"];
  q0 -> q29 [label="VisitController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@373dcd9d\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@3f730e66\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@323ab952\"\n}]"];
  q0 -> q33 [label="VisitController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@2ffa1f25\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@1cc3fcd6\"\n}]"];
  q2 -> q3 [label="PetController.populatePetTypes"];
  q2 -> q15 [label="PetController.populatePetTypes"];
  q3 -> q4 [label="PetController.findOwner\n[ownerId = 1]"];
  q3 -> q18 [label="PetController.findOwner\n[ownerId = 1]"];
  q3 -> q22 [label="PetController.findOwner\n[ownerId = 1]"];
  q4 -> q5 [label="PetController.initOwnerBinder\n[dataBinder = \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@3b9b3325\"]"];
  q5 -> q6 [label="PetController.initCreationForm\n[owner =\n    \"[Owner@6772f9c7\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\"]"];
  q6 -> q1 [label="PetController.initPetBinder\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@c85cbf7\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@46a95286\"\n}]"];
  q6 -> q16 [label="PetController.initPetBinder\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@48fe904f\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@467f21f8\"\n}]"];
  q7 -> q8 [label="OwnerController.findOwner\n[ownerId = null]"];
  q8 -> q0 [label="OwnerController.initCreationForm"];
  q9 -> q10 [label="OwnerController.findOwner\n[ownerId in {\n    null,\n    1\n}]"];
  q9 -> q20 [label="OwnerController.findOwner\n[ownerId = 1]"];
  q9 -> q35 [label="OwnerController.findOwner\n[ownerId = 1]"];
  q9 -> q39 [label="OwnerController.findOwner\n[ownerId = null]"];
  q10 -> q11 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@9c10e9c\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@11d85254\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@7914c8ac\"\n}]"];
  q10 -> q25 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@74b3f968\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@78381ea0\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@42d7b96\"\n}]"];
  q11 -> q12 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@2b17b49e\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@47cf6b01\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@5214cf10\"\n}]"];
  q12 -> q13 [label="OwnerController.processFindForm\n[owner in {\n    \"[Owner@177e6486\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\",\n    \"[Owner@2417f69f\n        id = [null],\n        new = true,\n        lastName = 'Unknown Surname',\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\",\n    \"[Owner@5e57b7ef\n        id = [null],\n        new = true,\n        lastName = 'Franklin',\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\"\n},\npage = 1]"];
  q13 -> q1 [label="OwnerController.findPaginatedForOwnersLastName\n[lastname in {\n    \"Unknown Surname\",\n    \"Franklin\"\n},\npage = 1]"];
  q13 -> q14 [label="OwnerController.findPaginatedForOwnersLastName\n[lastname = \"\",\npage = 1]"];
  q14 -> q1 [label="OwnerController.addPaginationModel\n[page = 1,\npaginated = \"Page 1 of 1 containing org.springframework.samples.petclinic.owner.Owner instances\"]"];
  q15 -> q6 [label="PetController.findOwner\n[ownerId = 1]"];
  q16 -> q17 [label="PetController.initOwnerBinder\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@37347be1\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@d030dd3\"\n}]"];
  q17 -> q1 [label="PetController.processUpdateForm\n[owner in {\n    \"[Owner@a1100b7\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\",\n    \"[Owner@46d50b32\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\"\n},\npet = \"Betty\"]"];
  q18 -> q19 [label="PetController.initOwnerBinder\n[dataBinder = \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@6e96492b\"]"];
  q19 -> q6 [label="PetController.initUpdateForm\n[owner =\n    \"[Owner@5256c05e\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\",\npetId = 1]"];
  q20 -> q21 [label="OwnerController.setAllowedFields\n[dataBinder = \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@3b4004cd\"]"];
  q21 -> q0 [label="OwnerController.initUpdateOwnerForm\n[ownerId = 1]"];
  q22 -> q23 [label="PetController.initOwnerBinder\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@2dec2b42\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@57104caa\"\n}]"];
  q23 -> q24 [label="PetController.initPetBinder\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@4f8c37c1\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@72309bc\"\n}]"];
  q24 -> q1 [label="PetController.processCreationForm\n[owner in {\n    \"[Owner@51c26394\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\",\n    \"[Owner@2c507e20\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\"\n},\npet = \"Betty\"]"];
  q25 -> q26 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@679a6394\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@2e205e62\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@7e486dcf\"\n}]"];
  q26 -> q1 [label="OwnerController.processUpdateOwnerForm\n[owner in {\n    \"[Owner@4bf48307\n        id = 1,\n        new = false,\n        lastName = 'Franklin',\n        firstName = 'George',\n        address = '110 W. Liberty St.',\n        city = 'Madison',\n        telephone = '6085551023'\n]\",\n    \"[Owner@18a71e25\n        id = 1,\n        new = false,\n        lastName = 'Bloggs',\n        firstName = 'Joe',\n        address = '',\n        city = 'Madison',\n        telephone = ''\n]\",\n    \"[Owner@32e2e611\n        id = 1,\n        new = false,\n        lastName = 'Bloggs',\n        firstName = 'Joe',\n        address = '123 Caramel Street',\n        city = 'London',\n        telephone = '01616291589'\n]\"\n},\nownerId = 1]"];
  q27 -> q28 [label="VetController.findPaginated\n[page = 1]"];
  q28 -> q1 [label="VetController.addPaginationModel\n[page = 1,\npaginated = \"Page 1 of 1 containing org.springframework.samples.petclinic.vet.Vet instances\"]"];
  q29 -> q30 [label="VisitController.setAllowedFields\n[dataBinder = \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@341ba2e0\"]"];
  q29 -> q32 [label="VisitController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@3d4fc9f5\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@59fc62ff\"\n}]"];
  q30 -> q31 [label="VisitController.loadPetWithVisit\n[ownerId = 1,\npetId = 1]"];
  q31 -> q0 [label="VisitController.initNewVisitForm"];
  q32 -> q0 [label="VisitController.loadPetWithVisit\n[ownerId = 1,\npetId = 1]"];
  q33 -> q34 [label="VisitController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@50599a7e\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@26928e2b\"\n}]"];
  q34 -> q0 [label="VisitController.processNewVisitForm\n[owner =\n    \"[Owner@8eeb409\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\",\npetId = 1,\nvisit = \"org.springframework.samples.petclinic.owner.Visit@68648137\"]"];
  q34 -> q1 [label="VisitController.processNewVisitForm\n[owner =\n    \"[Owner@6d654064\n        id = [null],\n        new = true,\n        lastName = [null],\n        firstName = [null],\n        address = [null],\n        city = [null],\n        telephone = [null]\n]\",\npetId = 1,\nvisit = \"org.springframework.samples.petclinic.owner.Visit@32cf3e7b\"]"];
  q35 -> q36 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@ae4c757\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@af53def\"\n}]"];
  q36 -> q0 [label="OwnerController.showOwner\n[ownerId = 1]"];
  q36 -> q38 [label="OwnerController.showOwner\n[ownerId = 1]"];
  q37 -> q38 [label="OwnerController.findOwner\n[ownerId = 1]"];
  q38 -> q0 [label="OwnerRepository.findById"];
  q38 -> q35 [label="OwnerRepository.findById"];
  q39 -> q40 [label="OwnerController.setAllowedFields\n[dataBinder in {\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@1dabc2f8\",\n    \"org.springframework.web.servlet.mvc.method.annotation.ExtendedServletRequestDataBinder@41997a02\"\n}]"];
  q40 -> q1 [label="OwnerController.processCreationForm\n[owner in {\n    \"[Owner@389467e9\n        id = [null],\n        new = true,\n        lastName = 'Bloggs',\n        firstName = 'Joe',\n        address = '123 Caramel Street',\n        city = 'London',\n        telephone = '01316761638'\n]\",\n    \"[Owner@7c8241eb\n        id = [null],\n        new = true,\n        lastName = 'Bloggs',\n        firstName = 'Joe',\n        address = [null],\n        city = 'London',\n        telephone = [null]\n]\"\n}]"];
  q41 -> q42 [label="OwnerController.findOwner\n[ownerId = null]"];
  q42 -> q0 [label="OwnerController.initFindForm"];
}
